# Week-05

In [1]:
# getwd() #ディレクトリ確認getwd() #ディレクトリ確認

In [2]:
# # setwd() に入れる Path は上記のディレクトリの下の data ファイル
# setwd("C:/Users/iiats/OneDrive/デスクトップ/１００本ノックチャレンジ/03_R_100_knocks/Questions/data") 
# getwd() #ディレクトリ確認

In [3]:
# DataFrameの準備
# 相対パスでデータを読み込む
df <- read.csv("./data/titanic3.csv", header=T)
df2 <- read.csv("./data/data1.csv", header=T)
df3 <- read.csv("./data/data1_2.csv", header=T)
df4 <- read.csv("./data/data1_3.csv", header=T)
df5 <- read.csv("./data/data2.csv", header=T, fileEncoding = "CP932")

In [4]:
head(df)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
6 1      1        Anderson, Mr. Harry                             male   48.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
3 1     2     113781 151.5500 C22 C26 S              NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
6 0     0     19952   26.5500 E12     S        3     NA
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON
6 New York, NY

# データ加工 (33 - 58)

In [5]:
# 【41】
# dfからbodyの列を削除し、最初の5行を表示

#削除したい行や列を選択し、NULLを代入することで削除ができる
df["body"] <- NULL 
head(df)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
6 1      1        Anderson, Mr. Harry                             male   48.00
  sibsp parch ticket fare     cabin   embarked boat
1 0     0     24160  211.3375 B5      S        2
2 1     2     113781 151.5500 C22 C26 S        11
3 1     2     113781 151.5500 C22 C26 S
4 1     2     113781 151.5500 C22 C26 S
5 1     2     113781 151.5500 C22 C26 S
6 0     0     19952   26.5500 E12     S        3
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON
6 New York, NY

In [6]:
# 別の方法
#インデックスを負の値にすると、その番号を除外した行列を返す性質を利用して、次のようにも書ける
df <- read.csv("./data/titanic3.csv", header=T)
df <- df[, -13]
head(df)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
6 1      1        Anderson, Mr. Harry                             male   48.00
  sibsp parch ticket fare     cabin   embarked boat
1 0     0     24160  211.3375 B5      S        2
2 1     2     113781 151.5500 C22 C26 S        11
3 1     2     113781 151.5500 C22 C26 S
4 1     2     113781 151.5500 C22 C26 S
5 1     2     113781 151.5500 C22 C26 S
6 0     0     19952   26.5500 E12     S        3
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON
6 New York, NY

In [7]:
# 【42】
# dfからインデックス名「3」の行を削除し、最初の5行を表示

df <- read.csv("./data/titanic3.csv", header=T)
head(df[-3,]) #行を削除

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
6 1      1        Anderson, Mr. Harry                             male   48.00
7 1      1        Andrews, Miss. Kornelia Theodosia               female 63.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
6 0     0     19952   26.5500 E12     S        3     NA
7 1     0     13502   77.9583 D7      S        10    NA
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON
6 New York, NY
7 Hudson, NY

In [8]:
# 【43】
# df2の列名を'name', 'class', 'Biology', 'Physics', 'Chemistry'に変更
# df2の最初の5行を表示

head(df2)

  name class English Mathmatics History
1 A    1     80       55        65
2 B    1     55      100        83
3 C    2     65       70        95
4 D    1     40       63        70
5 E    2     76       82        79
6 F    2     93       68        81

In [9]:
colnames(df2) <- c('name', 'class', 'Biology', 'Physics', 'Chemistry')
head(df2)

  name class Biology Physics Chemistry
1 A    1     80       55     65
2 B    1     55      100     83
3 C    2     65       70     95
4 D    1     40       63     70
5 E    2     76       82     79
6 F    2     93       68     81

In [10]:
# 【44】
# df2の列名を'English'をBiology'に変更
# df2の最初の5行を表示

# http://tips-r.blogspot.com/2018/02/r.html
df2 <- read.csv("./data/data1.csv", header=T)
colnames(df2)[3] <- "Bioligy"
head(df2)

  name class Bioligy Mathmatics History
1 A    1     80       55        65
2 B    1     55      100        83
3 C    2     65       70        95
4 D    1     40       63        70
5 E    2     76       82        79
6 F    2     93       68        81

In [11]:
# 別の方法
df2 <- read.csv("./data/data1.csv", header=T)
colnames(df2)[which(colnames(df2)=="English")] <- "Biology"
head(df2)

  name class Biology Mathmatics History
1 A    1     80       55        65
2 B    1     55      100        83
3 C    2     65       70        95
4 D    1     40       63        70
5 E    2     76       82        79
6 F    2     93       68        81

In [12]:
# 【45】
# df2のインデックス名「1」を「10」に変更
# df2の最初の5行を表示

df2 <- read.csv("./data/data1.csv", header=T)
rownames(df2)

 [1] "1"  "2"  "3"  "4"  "5"  "6"  "7"  "8"  "9"  "10"

In [13]:
rownames(df2)[2] <- '10'
head(rownames(df2))

Warning message:
"non-unique value when setting 'row.names': '10'"

ERROR: Error in `.rowNamesDF<-`(x, value = value): duplicate 'row.names' are not allowed

In [ ]:
# Rでは行のインデックスを書き換えるのは禁止されている？
# できた人は教えてください。

In [14]:
# 【46】
# dfのすべての列の欠損値数を確認

df <- read.csv("./data/titanic3.csv", header=T)
colSums(is.na(df))

   pclass  survived      name       sex       age     sibsp     parch    ticket
        0         0         0         0       263         0         0         0
     fare     cabin  embarked      boat      body home.dest
        1         0         0         0      1188         0

In [15]:
# 【47】
# dfのage列の欠損値に30を代入
# その後、ageの欠損値数を確認

df <- read.csv("./data/titanic3.csv", header=T)
df["age"][is.na(df["age"])] <- 30
colSums(is.na(df))

   pclass  survived      name       sex       age     sibsp     parch    ticket
        0         0         0         0         0         0         0         0
     fare     cabin  embarked      boat      body home.dest
        1         0         0         0      1188         0

In [16]:
# 別の方法
# https://www.it-swarm-ja.tech/ja/r/%E9%81%B8%E6%8A%9E%E3%81%97%E3%81%9F%E5%88%97%E3%81%AE%E3%83%86%E3%83%BC%E3%83%96%E3%83%AB%E3%81%AEna%E5%80%A4%E3%82%92%E7%BD%AE%E6%8F%9B%E3%81%99%E3%82%8B%E6%96%B9%E6%B3%95/1041462949/
df <- read.csv("./data/titanic3.csv", header=T)
df[, 5:5][is.na(df[, 5:5])] <- 30
colSums(is.na(df))

   pclass  survived      name       sex       age     sibsp     parch    ticket
        0         0         0         0         0         0         0         0
     fare     cabin  embarked      boat      body home.dest
        1         0         0         0      1188         0

In [17]:
# 【48】
# dfでひとつでも欠損値がある行を削除
# その後、dfの欠損値数を確認

df <- read.csv("./data/titanic3.csv", header=T)
df <- na.omit(df)
colSums(is.na(df))

   pclass  survived      name       sex       age     sibsp     parch    ticket
        0         0         0         0         0         0         0         0
     fare     cabin  embarked      boat      body home.dest
        0         0         0         0         0         0

In [18]:
# 【49】
# dfのsurvivedの列をndarray形式(配列)で表示 --> R では配列に

# http://cse.naro.affrc.go.jp/takezawa/r-tips/r/25.html
df <- read.csv("./data/titanic3.csv", header=T)
as.matrix(df["survived"])

# as.array() ではエラーが出て、as.matrix() では変わっていない異様です。
# 誰かわかりますか？

      survived
 [1,] 1
 [2,] 1
 [3,] 0
 [4,] 0
 [5,] 0
 [6,] 1
 [7,] 1
 [8,] 0
 [9,] 1
[10,] 0
[11,] 0
[12,] 1
[13,] 1
[14,] 1
[15,] 1
[16,] 0
[17,] 0
[18,] 1
[19,] 1
[20,] 0
[21,] 1
[22,] 1
[23,] 1
[24,] 1
[25,] 1
[26,] 0
[27,] 1
[28,] 1
[29,] 1
[30,] 1
[31,] ...
[32,] 0
[33,] 0
[34,] 0
[35,] 0
[36,] 0
[37,] 0
[38,] 0
[39,] 1
[40,] 0
[41,] 0
[42,] 0
[43,] 1
[44,] 0
[45,] 0
[46,] 0
[47,] 0
[48,] 0
[49,] 0
[50,] 0
[51,] 0
[52,] 0
[53,] 1
[54,] 0
[55,] 0
[56,] 0
[57,] 0
[58,] 0
[59,] 0
[60,] 0
[61,] 0

In [19]:
# 【50】
# dfの行をシャッフルして表示

# https://www.it-swarm-ja.tech/ja/r/%E3%83%87%E3%83%BC%E3%82%BF%E3%83%95%E3%83%AC%E3%83%BC%E3%83%A0%E3%82%92%E8%A1%8C%E3%81%94%E3%81%A8%E3%81%8A%E3%82%88%E3%81%B3%E5%88%97%E3%81%94%E3%81%A8%E3%81%AB%E3%83%A9%E3%83%B3%E3%83%80%E3%83%A0%E5%8C%96%EF%BC%88%E3%81%BE%E3%81%9F%E3%81%AF%E4%B8%A6%E3%81%B9%E6%9B%BF%E3%81%88%EF%BC%89%E3%81%99%E3%82%8B%E3%81%AB%E3%81%AF%E3%81%A9%E3%81%86%E3%81%99%E3%82%8C%E3%81%B0%E3%82%88%E3%81%84%E3%81%A7%E3%81%99%E3%81%8B%EF%BC%9F/972584365/
df_tmp <- df[sample(nrow(df)),]
head(df_tmp)

     pclass survived name                        sex    age sibsp parch
153  1      1        Hawksford, Mr. Walter James male   NA  0     0
1113 3      0        Peacock, Miss. Treasteall   female  3  1     1
454  2      0        Hood, Mr. Ambrose Jr        male   21  0     0
881  3      1        Jalsevac, Mr. Ivan          male   29  0     0
1247 3      0        Thorneycroft, Mr. Percival  male   NA  1     0
1074 3      0        O'Connor, Mr. Maurice       male   NA  0     0
     ticket             fare    cabin embarked boat body home.dest
153  16988              30.0000 D45   S        3    NA   Kingston, Surrey
1113 SOTON/O.Q. 3101315 13.7750       S             NA
454  S.O.C. 14879       73.5000       S             NA   New Forest, England
881  349240              7.8958       C        15   NA
1247 376564             16.1000       S             NA
1074 371060              7.7500       Q             NA